---
type: IntersectionResultArray
namespace: Autodesk.Revit.DB
version: 2024
members: 10
tags: [revit-api, class]
---

# IntersectionResultArray

`Autodesk.Revit.DB.IntersectionResultArray` · Revit 2024 · 10 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | IntersectionResultArray | — | `public IntersectionResultArray ()` |
| Method | Append | — | `public virtual void Append ( IntersectionResult item )` |
| Method | Clear | — | `public virtual void Clear ()` |
| Method | ForwardIterator | — | `public virtual IntersectionResultArrayIterator ForwardIterator ()` |
| Method | GetEnumerator | — | `public virtual IEnumerator GetEnumerator ()` |
| Method | Insert | — | `public virtual void Insert ( IntersectionResult item , int index )` |
| Method | ReverseIterator | — | `public virtual IntersectionResultArrayIterator ReverseIterator ()` |
| Property | IsEmpty | — | `public virtual bool IsEmpty { get ; }` |
| Property | Item | — | `public virtual IntersectionResult this [ int index ] { get ; set ; }` |
| Property | Size | — | `public virtual int Size { get ; }` |